<a href="https://colab.research.google.com/github/tbonne/IntroDataScience/blob/main/fullNoteBooks/IntroData5_CombineData_full.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src='http://drive.google.com/uc?export=view&id=1PmB2IttC7fpQdCjY9F03KDnV_Oe_MtCp' width="300" align = 'left'>

# <font color='lightblue'>Combining data</font>

This exercise will walk you through how to combine dataframes. Often combining dataframes will let you add aditional information to each row, or add additional rows.

Outline:
*  Look at how to add more rows of data using **concat**
*  Look at how to add more columns of data using **join**

## <font color='lightblue'>Concatinating</font>

 Concatinating let's us combine two dataframes, that share similar columns, vertically. You can think of this as stacking one dataframe ontop of another.

In [35]:
#import pandas 
import pandas as pd
import numpy as np

In [36]:
#create a simple dataframe
df_top = pd.DataFrame({'score':[12,22,13,24,15], 'class':['1','1',np.NaN,'2','2']})

#take a look
df_top

   score class
0     12     1
1     22     1
2     13   NaN
3     24     2
4     15     2

In [37]:
#create a simple dataframe
df_bottom = pd.DataFrame({'score':[16,17,18,19,20], 'class':['3','3','4','4','4']})

#take a look
df_bottom

   score class
0     16     3
1     17     3
2     18     4
3     19     4
4     20     4

In [38]:
#contaconate the dataframes together. Note: the square brackets are there to pass the dataframes to the concat method as a list of dataframes.
pd.concat([df_top,df_bottom])

   score class
0     12     1
1     22     1
2     13   NaN
3     24     2
4     15     2
0     16     3
1     17     3
2     18     4
3     19     4
4     20     4

But what happends when there are extra or missing columns?

In [39]:
#create a simple dataframe without the B column and a new column
df_messy = pd.DataFrame({'score':[11,21],'school':['1','2']})

#take a look
df_messy

   score school
0     11      1
1     21      2

In [40]:
pd.concat([df_top,df_bottom,df_messy])

   score class school
0     12     1    NaN
1     22     1    NaN
2     13   NaN    NaN
3     24     2    NaN
4     15     2    NaN
0     16     3    NaN
1     17     3    NaN
2     18     4    NaN
3     19     4    NaN
4     20     4    NaN
0     11   NaN      1
1     21   NaN      2

We can see that when we contatinate the dataframes, pandas adds in missing values where there are no values.

<img src='http://drive.google.com/uc?export=view&id=1WC4tXGCEF-1_2LQ74gIxJAZ-GLXCwBdK' width="100" align = 'left'>

Try to create two dataframes with the same column names, and then use concat to combine them.

In [41]:
#create first
df1 = pd.DataFrame({'player':[1,2,3,4],'team':['blue','blue','blue','blue'] })

#create second
df2 = pd.DataFrame({'player':[11,12,13,14],'team':['green','green','green','green'] })

#combine the dataframes
pd.concat([df1, df2])

   player   team
0       1   blue
1       2   blue
2       3   blue
3       4   blue
0      11  green
1      12  green
2      13  green
3      14  green

## <font color='lightblue'>Joining</font>


Joining lets us combine two dataframes that share similar values horizontally. You can think of this as sliding two dataframes next to each other.

When joining you often want to increase the amount of information in each row (i.e., adding more columns).

Let's try a **left join**

In [42]:
#let's use as the dataframe of interest
df_top

   score class
0     12     1
1     22     1
2     13   NaN
3     24     2
4     15     2

In [43]:
#create some extra information
df_right = pd.DataFrame({'class':['1','2','3'],
                         'teacher':['Robby','Sarah','Alex']})

#take a look
df_right

  class teacher
0     1   Robby
1     2   Sarah
2     3    Alex

In [44]:
#Let's add some extra information to each row
pd.merge(left=df_top,right=df_right,on='class', how="left")

   score class teacher
0     12     1   Robby
1     22     1   Robby
2     13   NaN     NaN
3     24     2   Sarah
4     15     2   Sarah

Notice how the merge took the two teacher names and associated them with the right class. Here we end up with many rows with Robby and Sarah. This is an example of a many-to-one join.

Right join

In [45]:
pd.merge(left=df_top,right=df_right,on='class', how="right")

   score class teacher
0   12.0     1   Robby
1   22.0     1   Robby
2   24.0     2   Sarah
3   15.0     2   Sarah
4    NaN     3    Alex

Inner join

In [46]:
pd.merge(left=df_top,right=df_right,on='class', how="inner")

   score class teacher
0     12     1   Robby
1     22     1   Robby
2     24     2   Sarah
3     15     2   Sarah

outer join

In [47]:
pd.merge(left=df_top,right=df_right,on='class', how="outer")

   score class teacher
0   12.0     1   Robby
1   22.0     1   Robby
2   13.0   NaN     NaN
3   24.0     2   Sarah
4   15.0     2   Sarah
5    NaN     3    Alex

Generally when joining two dataframes the left join is the most common. In this case you have a main dataframe that you'd like to add information to.

## <font color='lightblue'>Join airport data</font>

Let's load in the flight data again and add airport size information using joins!

In [48]:
#load flight data from google drive
df_flights = pd.read_csv("/content/nyc_flight_data.csv")

#take a look
df_flights

      Unnamed: 0  year  month  day  ...  distance  hour  minute            time_hour
0              1  2013      1    1  ...      1400     5      15  2013-01-01 05:00:00
1              2  2013      1    1  ...      1416     5      29  2013-01-01 05:00:00
2              3  2013      1    1  ...      1089     5      40  2013-01-01 05:00:00
3              4  2013      1    1  ...      1576     5      45  2013-01-01 05:00:00
4              5  2013      1    1  ...       762     6       0  2013-01-01 06:00:00
...          ...   ...    ...  ...  ...       ...   ...     ...                  ...
3609        3610  2013      1    4  ...       488    18      30  2013-01-04 18:00:00
3610        3611  2013      1    4  ...      1389     9      20  2013-01-04 09:00:00
3611        3612  2013      1    4  ...      1389    12      45  2013-01-04 12:00:00
3612        3613  2013      1    4  ...      1372    14      30  2013-01-04 14:00:00
3613        3614  2013      1    4  ...       888    15      30  2013-01-04 15:00:00

[3614 rows x 20 columns]

Download the data with the destination [information](https://drive.google.com/file/d/1-ACJcTJkGlHG_lNqeNIjACh6Dt7NHxBZ/view?usp=sharing).

In [49]:
#place the file in your google drive folder, and load it into colab using pd.read_cvs()
df_dest = pd.read_csv('/content/destination_size.csv')

#take a look
df_dest

   dest    size
0   ALB   266.0
1   ATL  1314.0
2   AUS   397.0
3   AVL    47.0
4   BDL   181.0
..  ...     ...
84  SYR   274.0
85  TPA   567.0
86  TUL   118.0
87  TYS   259.0
88  XNA   157.0

[89 rows x 2 columns]

<img src='http://drive.google.com/uc?export=view&id=1WC4tXGCEF-1_2LQ74gIxJAZ-GLXCwBdK' width="100" align = 'left'>

Can you merge the two dataframes (df_flights and df_dest) so that you'll have all the destination airport sizes. 
> This might be useful to compare arrival delays of individual flights to the size of the airport?

In [50]:
#join the two dataframes so that you'll have 
pd.merge(left=df_flights,right=df_dest,on='dest', how="inner")

      Unnamed: 0  year  month  day  ...  hour  minute            time_hour   size
0              1  2013      1    1  ...     5      15  2013-01-01 05:00:00  781.0
1              2  2013      1    1  ...     5      29  2013-01-01 05:00:00  781.0
2             33  2013      1    1  ...     6      27  2013-01-01 06:00:00  781.0
3             82  2013      1    1  ...     7      32  2013-01-01 07:00:00  781.0
4             90  2013      1    1  ...     7      39  2013-01-01 07:00:00  781.0
...          ...   ...    ...  ...  ...   ...     ...                  ...    ...
3609        3608  2013      1    4  ...    23      59  2013-01-04 23:00:00  -58.0
3610        1717  2013      1    2  ...    20       5  2013-01-02 20:00:00  -21.0
3611        2522  2013      1    3  ...    18      58  2013-01-03 18:00:00  -21.0
3612        3451  2013      1    4  ...    18      58  2013-01-04 18:00:00  -21.0
3613        2512  2013      1    3  ...    18      28  2013-01-03 18:00:00   36.0

[3614 rows x 21 columns]

 What kind of join did you use?

By merging the two dataframes we now have the amount of delay along with the size of the destination airport. We could then look at the relationship between the two using a figure or a model.

## <font color='lightblue'>Further reading</font>

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html